# Разбор задачек 
Задача: Фильтрация четных и нечетных чисел

Напишите программу, которая запрашивает у пользователя ввод последовательности чисел, разделенных запятыми. 
Программа должна разбить входную строку на отдельные числа, преобразовать их в целые числа и разделить их 
на две группы: четные и нечетные. В конце программа должна вывести обе группы на экран.

# Требования:
 1. Проверьте, что пользователь ввел только числа, если ввод недопустим, отобразите сообщение об ошибке и запросите ввод снова.
 2. Используйте списковые включения для создания списков четных и нечетных чисел.
 3. Выведите результат в следующем формате:
       Четные числа: [число1, число2, ...]
       Нечетные числа: [число1, число2, ...]

# Решение
def main():
    while True:
        user_input = input("Введите числа, разделенные запятыми: ")
        
        # Попытка преобразовать ввод в список целых чисел
        try:
            numbers = [int(num.strip()) for num in user_input.split(',')]
            break  # Если успешно, выходим из цикла
        except ValueError:
            print("Ошибка: Пожалуйста, введите только числа, разделенные запятыми.")

    # Разделение чисел на четные и нечетные
    even_numbers = [num for num in numbers if num % 2 == 0]
    odd_numbers = [num for num in numbers if num % 2 != 0]

    # Вывод результата
    print(f"Четные числа: {even_numbers}")
    print(f"Нечетные числа: {odd_numbers}")

if __name__ == "__main__":
    main()

    ### Как работает код:
1. Программа запрашивает у пользователя ввод чисел, разделенных запятыми.
2. Подсчитывает и обрабатывает введенные числа:
- Используется `try-except` для обработки ошибок ввода, чтобы обеспечить возможность ввода только чисел.
3. Разделяет числа на четные и нечетные с помощью списковых включений.
4. Выводит результат в нужном формате.
